Revit 2026 API

# ConduitTypeIsWithFitting Property

---

Whether this conduit type is with fitting

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsWithFitting { get; }
```
```vb
Public ReadOnly Property IsWithFitting As Boolean
	Get
```
```cpp
public:
property bool IsWithFitting {
	bool get ();
}
```
```fsharp
member IsWithFitting : bool with get
```

#### Property Value

Boolean

True if this conduit type is with fitting type.

#### Reference

ConduitType Class

Autodesk.Revit.DB.Electrical Namespace